#include <iostream>
using namespace std;
int main()
{
	/*std::system("chcp 1251");
	double R1, R2, R3;
	cout << "Введите R1 и нажмите Enter : ";
	cin >> R1;
	cout << "Введите R2 и нажмите Enter : ";
	cin >> R2;
	cout << "Введите R3 и нажмите Enter : ";
	cin >> R3;
	double R0 = 1 / R1 + 1 / R2 + 1 / R3;
	cout << "R0 = " << R0;*/

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//const double pi = 3.14;
	//double S, L, R;
	//cout << "Длина круга (L) = ";
	//cin >> L;
	//R = L / (2 * pi);
	//S = pi * R * R;
	//cout << "Площадь круга (S) = " << S;

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double V, T, A;
	//cout << "Скорость (V) = ";
	//cin >> V;
	//cout << "Время (T) = ";
	//cin >> T;
	//cout << "Ускорение (A) = ";
	//cin >> A;
	//double S = V * T + (A * T * T) / 2;
	//cout << "Расстояние (S) = " << S;

	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int seconds, minutes, hours;
	//cout << "Введите количество секунд : ";
	//cin >> seconds;
	//minutes = seconds / 60;
	//seconds = seconds % 60;
	//hours = minutes / 60;
	//minutes = minutes % 60;
	//cout << "Часы : " << hours << "\n";
	//cout << "Минуты : " << minutes << "\n";
	//cout << "Секунды : " << seconds << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double number;
	//int dollar, cent;
	//cout << "Введите дробное значение : ";
	//cin >> number;
	//dollar = number;
	//cent = (number - dollar) * 100;
	//cout << "Долларов : " << dollar << "\n";
	//cout << "Центов : " << cent << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int days, weeks;
	//cout << "Введите количество дней : ";
	//cin >> days;
	//weeks = days / 7;
	//days = days % 7;
	//cout << "Недель : " << weeks << "\n";
	//cout << "Дней : " << days << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double speed, distance, time;
	//int minutes, seconds;
	//cout << "Вычисление скорости бега." << "\n";
	//cout << "Введите длину дистанции (метров) : ";
	//cin >> distance;
	//cout << "Введите время (мин.сек) : ";
	//cin >> time;
	//minutes = time;
	//seconds = (time - minutes) * 100;
	//time = (minutes * 60) + seconds;
	//speed = distance / time * 3.6;
	//cout << "Дистанция : " << distance << " м " << "\n";
	//cout << "Время: " << minutes << " мин " << seconds << " сек = " << time << " сек " << "\n";
	//cout << "Вы бежали со скоростью : " << speed << " км/ч" << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double summa, percent, bet, payout; 
	//cout << "Введите сумму денежного вклада в евро : "; 
	//cin >> summa; cout << "Введите процент годовых, которые выплачивает банк : "; 
	//cin >> percent; bet = percent / 12; payout = summa * (bet / 100); 
	//cout << "Сумма денег, выплачиваемая банком вкладчику каждый месяц : " << payout << " евро" << "\n";


	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int userNumber, d1, d2, d3, d4, d5, d6, sum1, sum2, temp;
	//cout << "Введите шестизначное число : ";
	//cin >> userNumber;
	//if (userNumber / 100000 < 1)
	//{
	//	cout << "Введеное число меньше шести знаков!";
	//}
	//else if (userNumber / 100000 > 9)
	//{
	//	cout << "Введенное число больше шести знаков!";
	//}
	//else
	//{
	//	d6 = userNumber % 10;
	//	temp = userNumber / 10;
	//	d5 = temp % 10;
	//	temp = temp / 10;
	//	d4 = temp % 10;
	//	temp = temp / 10;
	//	d3 = temp % 10;
	//	temp = temp / 10;
	//	d2 = temp % 10;
	//	d1 = temp / 10;
	//	cout << d1 << " " << d2 << " " << d3 << " ";
	//	cout << d4 << " " << d5 << " " << d6;
	//	sum1 = d1 + d2 + d3;
	//	sum2 = d4 + d5 + d6;
	//	if (sum1 == sum2)
	//	{
	//		cout << " Введенное число является счастливым!";
	//	}
	//	else 
	//	{
	//		cout << " Введенное число не является счастливым!";
	//	}
	//}

	//------------------------------------------------------------------------------------------------------------------------------------------//
	
	//std::system("chcp 1251");
	//int userNumber, d1, d2, d3, d4, newNumber, temp;
	//cout << "Введите четырехзначное число: ";
	//cin >> userNumber;
	//if (userNumber / 1000 < 1)
	//{
	//	cout << "Введеном числе меньше четырех знаков!";
	//}
	//else if (userNumber / 1000 > 9)
	//{
	//	cout << "Введеном числе больше четырех знаков!";
	//}
	//else
	//{
	//	d4 = userNumber % 10;
	//	temp = userNumber / 10;
	//	d3 = temp % 10;
	//	temp = temp / 10;
	//	d2 = temp % 10;
	//	d1 = temp / 10;
	//	newNumber = d2 * 1000 + d1 * 100 + d4 *
	//		10 + d3;
	//	cout << "Ваше перевернутое число: " << newNumber;
	//}

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int a1, a2, a3, a4, a5, a6, a7, maxnum;
	//cout << "Введите первое число: ";
	//cin >> a1;
	//maxnum = a1;
	//cout << "Введите второе число: ";
	//cin >> a2;
	//(maxnum >= a2) ? true : maxnum = a2;
	//cout << "Введите третье число: ";
	//cin >> a3;
	//(maxnum >= a3) ? true : maxnum = a3;
	//cout << "Введите четверное число: ";
	//cin >> a4;
	//(maxnum >= a4) ? true : maxnum = a4;
	//cout << "Введите пятое число: ";
	//cin >> a5;
	//(maxnum >= a5) ? true : maxnum = a5;
	//cout << "Введите шестое число: ";
	//cin >> a6;
	//(maxnum >= a6) ? true : maxnum = a6;
	//cout << "Введите седьмое число: ";
	//cin >> a7;
	//(maxnum >= a7) ? true : maxnum = a7;
	/*cout << "Максимальное число: " << maxnum;*/

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int ab, bc, kg;
	//cout << "Введите расстояние между пунктами А и В в км: ";
	//cin >> ab;
	//cout << "Введите расстояние между пунктами В и С в км: ";
	//cin >> bc;
	//cout << "Введите вес груза в кг: ";
	//cin >> kg;
	//if (kg > 2000) {
	//	cout << "Самолет " << kg << " не поднимает." << endl;
	//}
	//else {
	//	int lit;

	//	if (kg <= 500) lit = 1;
	//	else if (kg <= 1000) lit = 4;
	//	else if (kg <= 1500) lit = 7;
	//	else             lit = 9;

	//	int top_ab = ab * lit;
	//	int top_bc = bc * lit;
	//	if (top_ab > 300) {
	//		cout << "Невозможен полет по маршруту AB!";
	//	}
	//	else if (top_bc > 300) {
	//		cout << "Невозможен полет по маршруту BC!";
	//	}
	//	else {
	//		int ost = 300 - top_ab - top_bc;
	//		if (ost >= 0) 
	//		{
	//			cout << "Полет возможен без дозаправки.";
	//		}
	//		else 
	//		{
	//			cout << "Полет возможен, но надо в пункте B долить " << -ost;
	//		}
	//	}
	//}

//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int pizza_id, nap_id, pizza_kol, nap_kol,
//temp;
//float pizza1, pizza2, pizza3, pizza4, pizza_price;
//float nap1, nap2, nap3,
//nap_price;
//float summa;
//pizza1 = 7.25;
//pizza2 = 6.55;
//pizza3 = 16.50;
//pizza4 = 14.60;
//nap1 = 2.05;
//nap2 = 2.5;
//nap3 = 1.25;
//summa = 0;
//cout << "Выберите пиццу: \n";
//cout << "1 - Пеперони $" << pizza1 << "\n";
//cout << "2 - Четыре сыра $" << pizza2 << "\n";
//cout << "3 - Маргарита $" << pizza3 << "\n";
//cout << "4 - Итальянская $" << pizza4 << "\n";
//cin >> pizza_id;
//cout << "Укажите количество пицц: ";
//cin >> pizza_kol;
//cout << "Выберите напиток: \n";
//cout << "1 - Кола $" << nap1 << "\n";
//cout << "2 - Сок $" << nap2 << "\n";
//cout << "3 - Фанта $" << nap3 << "\n";
//cin >> nap_id;
//cout << "Укажите количество напитков: ";
//cin >> nap_kol;
//switch (pizza_id)
//{
//case 1:
//	pizza_price = pizza1;
//	break;
//case 2:
//	pizza_price = pizza2;
//	break;
//case 3:
//	pizza_price = pizza3;
//	break;
//case 4:
//	pizza_price = pizza4;
//	break;
//default:
//	cout << "В меню нет такой пиццы!\n";
//	pizza_price = 0;
//	break;
//}
//switch (nap_id)
//{
//case 1:
//	nap_price = nap1;
//	break;
//case 2:
//	nap_price = nap2;
//	break;
//case 3:
//	nap_price = nap3;
//	break;
//default:
//	cout << "В меню нет такого напитка!\n";
//	nap_price = 0;
//	break;
//}
//temp = pizza_kol;
//if (pizza_kol >= 5)
//{
//	cout << "Применена скидка на каждую 5-ю пиццу в подарок!\n";
//	pizza_kol = pizza_kol - pizza_kol / 5;
//}
//summa = summa + pizza_kol * pizza_price;
//if ((nap_kol >= 3) && (nap_price > 2))
//{
//	cout << "Применена скидка 15% на напитки!\n";
//	summa = summa + nap_kol *nap_price * (1 - 0.15);
//}
//else
//{
//	summa = summa + nap_kol * nap_price;
//}
//if (summa > 50)
//{
//	cout << "Применена скидка 20% на весь заказ!\n";
//	summa = summa * (1 - 0.2);
//}
//cout << "Ваш заказ:\n";
//cout << "Пицца: " << pizza_id << " - " << temp << "штук " << "по " << pizza_price << "$" << "\n";
//cout << "Напиток: " << nap_id << " - " << nap_kol << "штук " << "по " << nap_price << "$" << "\n";
//cout << "Итого: " << summa << "$" << "\n";

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int man1, man2, man3, best_man;
//float zp1, zp2, zp3;
//cout << "Укажите уровень продаж первого менеджера: ";
//cin >> man1;
//cout << "Укажите уровень продаж второго менеджера: ";
//cin >> man2;
//cout << "Укажите уровень продаж третьего менеджера: ";
//cin >> man3;
//if (man1 < 500)
//{
//	zp1 = 200 + man1 * 0.003;
//}
//else if ((man1 >= 500) && (man1 < 1000))
//{
//	zp1 = 200 + man1 * 0.005;
//}
//else
//{
//	zp1 = 200 + man1 * 0.008;
//}
//if (man2 < 500)
//{
//	zp2 = 200 + man2 * 0.003;
//}
//else if ((man1 >= 500) && (man2 < 1000))
//{
//	zp2 = 200 + man2 * 0.005;
//}
//else
//{
//	zp2 = 200 + man2 * 0.008;
//}
//if (man3 < 500)
//{
//	zp3 = 200 + man3 * 0.003;
//}
//else if ((man1 >= 500) && (man3 < 1000))
//{
//	zp3 = 200 + man3 * 0.005;
//}
//else
//{
//	zp3 = 200 + man3 * 0.008;
//}
//if (man1 > man2)
//{
//	best_man = 1;
//}
//else
//{
//	best_man = 2;
//}
//if (man3 > best_man)
//{
//	best_man = 3;
//}
//switch (best_man) {
//case 1:
//	zp1 = zp1 + 200;
//	break;
//case 2:
//	zp2 = zp2 + 200;
//	break;
//case 3:
//	zp3 = zp3 + 200;
//	break;
//}
//cout << "Лучший менеджер - " << best_man << ". Ему начислено 200$ к зарплате. \n";
//cout << "Зарплата первого менеджера: " << zp1 << "\n";
//cout << "Зарплата второго менеджера: " << zp2 << "\n";
//cout << "Зарплата третьего менеджера:" << zp3 << "\n";

//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//

}
