#include <iostream>
#include <windows.h>
using namespace std;
int main()
{
	/*std::system("chcp 1251");
	double R1, R2, R3;
	cout << "Введите R1 и нажмите Enter : ";
	cin >> R1;
	cout << "Введите R2 и нажмите Enter : ";
	cin >> R2;
	cout << "Введите R3 и нажмите Enter : ";
	cin >> R3;
	double R0 = 1 / R1 + 1 / R2 + 1 / R3;
	cout << "R0 = " << R0;*/

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//const double pi = 3.14;
	//double S, L, R;
	//cout << "Длина круга (L) = ";
	//cin >> L;
	//R = L / (2 * pi);
	//S = pi * R * R;
	//cout << "Площадь круга (S) = " << S;

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double V, T, A;
	//cout << "Скорость (V) = ";
	//cin >> V;
	//cout << "Время (T) = ";
	//cin >> T;
	//cout << "Ускорение (A) = ";
	//cin >> A;
	//double S = V * T + (A * T * T) / 2;
	//cout << "Расстояние (S) = " << S;

	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int seconds, minutes, hours;
	//cout << "Введите количество секунд : ";
	//cin >> seconds;
	//minutes = seconds / 60;
	//seconds = seconds % 60;
	//hours = minutes / 60;
	//minutes = minutes % 60;
	//cout << "Часы : " << hours << "\n";
	//cout << "Минуты : " << minutes << "\n";
	//cout << "Секунды : " << seconds << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double number;
	//int dollar, cent;
	//cout << "Введите дробное значение : ";
	//cin >> number;
	//dollar = number;
	//cent = (number - dollar) * 100;
	//cout << "Долларов : " << dollar << "\n";
	//cout << "Центов : " << cent << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int days, weeks;
	//cout << "Введите количество дней : ";
	//cin >> days;
	//weeks = days / 7;
	//days = days % 7;
	//cout << "Недель : " << weeks << "\n";
	//cout << "Дней : " << days << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double speed, distance, time;
	//int minutes, seconds;
	//cout << "Вычисление скорости бега." << "\n";
	//cout << "Введите длину дистанции (метров) : ";
	//cin >> distance;
	//cout << "Введите время (мин.сек) : ";
	//cin >> time;
	//minutes = time;
	//seconds = (time - minutes) * 100;
	//time = (minutes * 60) + seconds;
	//speed = distance / time * 3.6;
	//cout << "Дистанция : " << distance << " м " << "\n";
	//cout << "Время: " << minutes << " мин " << seconds << " сек = " << time << " сек " << "\n";
	//cout << "Вы бежали со скоростью : " << speed << " км/ч" << "\n";

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//double summa, percent, bet, payout; 
	//cout << "Введите сумму денежного вклада в евро : "; 
	//cin >> summa; cout << "Введите процент годовых, которые выплачивает банк : "; 
	//cin >> percent; bet = percent / 12; payout = summa * (bet / 100); 
	//cout << "Сумма денег, выплачиваемая банком вкладчику каждый месяц : " << payout << " евро" << "\n";


	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//
	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int userNumber, d1, d2, d3, d4, d5, d6, sum1, sum2, temp;
	//cout << "Введите шестизначное число : ";
	//cin >> userNumber;
	//if (userNumber / 100000 < 1)
	//{
	//	cout << "Введеное число меньше шести знаков!";
	//}
	//else if (userNumber / 100000 > 9)
	//{
	//	cout << "Введенное число больше шести знаков!";
	//}
	//else
	//{
	//	d6 = userNumber % 10;
	//	temp = userNumber / 10;
	//	d5 = temp % 10;
	//	temp = temp / 10;
	//	d4 = temp % 10;
	//	temp = temp / 10;
	//	d3 = temp % 10;
	//	temp = temp / 10;
	//	d2 = temp % 10;
	//	d1 = temp / 10;
	//	cout << d1 << " " << d2 << " " << d3 << " ";
	//	cout << d4 << " " << d5 << " " << d6;
	//	sum1 = d1 + d2 + d3;
	//	sum2 = d4 + d5 + d6;
	//	if (sum1 == sum2)
	//	{
	//		cout << " Введенное число является счастливым!";
	//	}
	//	else 
	//	{
	//		cout << " Введенное число не является счастливым!";
	//	}
	//}

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int userNumber, d1, d2, d3, d4, newNumber, temp;
	//cout << "Введите четырехзначное число: ";
	//cin >> userNumber;
	//if (userNumber / 1000 < 1)
	//{
	//	cout << "Введеном числе меньше четырех знаков!";
	//}
	//else if (userNumber / 1000 > 9)
	//{
	//	cout << "Введеном числе больше четырех знаков!";
	//}
	//else
	//{
	//	d4 = userNumber % 10;
	//	temp = userNumber / 10;
	//	d3 = temp % 10;
	//	temp = temp / 10;
	//	d2 = temp % 10;
	//	d1 = temp / 10;
	//	newNumber = d2 * 1000 + d1 * 100 + d4 *
	//		10 + d3;
	//	cout << "Ваше перевернутое число: " << newNumber;
	//}

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int a1, a2, a3, a4, a5, a6, a7, maxnum;
	//cout << "Введите первое число: ";
	//cin >> a1;
	//maxnum = a1;
	//cout << "Введите второе число: ";
	//cin >> a2;
	//(maxnum >= a2) ? true : maxnum = a2;
	//cout << "Введите третье число: ";
	//cin >> a3;
	//(maxnum >= a3) ? true : maxnum = a3;
	//cout << "Введите четверное число: ";
	//cin >> a4;
	//(maxnum >= a4) ? true : maxnum = a4;
	//cout << "Введите пятое число: ";
	//cin >> a5;
	//(maxnum >= a5) ? true : maxnum = a5;
	//cout << "Введите шестое число: ";
	//cin >> a6;
	//(maxnum >= a6) ? true : maxnum = a6;
	//cout << "Введите седьмое число: ";
	//cin >> a7;
	//(maxnum >= a7) ? true : maxnum = a7;
	/*cout << "Максимальное число: " << maxnum;*/

	//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int ab, bc, kg;
	//cout << "Введите расстояние между пунктами А и В в км: ";
	//cin >> ab;
	//cout << "Введите расстояние между пунктами В и С в км: ";
	//cin >> bc;
	//cout << "Введите вес груза в кг: ";
	//cin >> kg;
	//if (kg > 2000) {
	//	cout << "Самолет " << kg << " не поднимает." << endl;
	//}
	//else {
	//	int lit;

	//	if (kg <= 500) lit = 1;
	//	else if (kg <= 1000) lit = 4;
	//	else if (kg <= 1500) lit = 7;
	//	else             lit = 9;

	//	int top_ab = ab * lit;
	//	int top_bc = bc * lit;
	//	if (top_ab > 300) {
	//		cout << "Невозможен полет по маршруту AB!";
	//	}
	//	else if (top_bc > 300) {
	//		cout << "Невозможен полет по маршруту BC!";
	//	}
	//	else {
	//		int ost = 300 - top_ab - top_bc;
	//		if (ost >= 0) 
	//		{
	//			cout << "Полет возможен без дозаправки.";
	//		}
	//		else 
	//		{
	//			cout << "Полет возможен, но надо в пункте B долить " << -ost;
	//		}
	//	}
	//}

//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int pizza_id, nap_id, pizza_kol, nap_kol,
//temp;
//float pizza1, pizza2, pizza3, pizza4, pizza_price;
//float nap1, nap2, nap3,
//nap_price;
//float summa;
//pizza1 = 7.25;
//pizza2 = 6.55;
//pizza3 = 16.50;
//pizza4 = 14.60;
//nap1 = 2.05;
//nap2 = 2.5;
//nap3 = 1.25;
//summa = 0;
//cout << "Выберите пиццу: \n";
//cout << "1 - Пеперони $" << pizza1 << "\n";
//cout << "2 - Четыре сыра $" << pizza2 << "\n";
//cout << "3 - Маргарита $" << pizza3 << "\n";
//cout << "4 - Итальянская $" << pizza4 << "\n";
//cin >> pizza_id;
//cout << "Укажите количество пицц: ";
//cin >> pizza_kol;
//cout << "Выберите напиток: \n";
//cout << "1 - Кола $" << nap1 << "\n";
//cout << "2 - Сок $" << nap2 << "\n";
//cout << "3 - Фанта $" << nap3 << "\n";
//cin >> nap_id;
//cout << "Укажите количество напитков: ";
//cin >> nap_kol;
//switch (pizza_id)
//{
//case 1:
//	pizza_price = pizza1;
//	break;
//case 2:
//	pizza_price = pizza2;
//	break;
//case 3:
//	pizza_price = pizza3;
//	break;
//case 4:
//	pizza_price = pizza4;
//	break;
//default:
//	cout << "В меню нет такой пиццы!\n";
//	pizza_price = 0;
//	break;
//}
//switch (nap_id)
//{
//case 1:
//	nap_price = nap1;
//	break;
//case 2:
//	nap_price = nap2;
//	break;
//case 3:
//	nap_price = nap3;
//	break;
//default:
//	cout << "В меню нет такого напитка!\n";
//	nap_price = 0;
//	break;
//}
//temp = pizza_kol;
//if (pizza_kol >= 5)
//{
//	cout << "Применена скидка на каждую 5-ю пиццу в подарок!\n";
//	pizza_kol = pizza_kol - pizza_kol / 5;
//}
//summa = summa + pizza_kol * pizza_price;
//if ((nap_kol >= 3) && (nap_price > 2))
//{
//	cout << "Применена скидка 15% на напитки!\n";
//	summa = summa + nap_kol *nap_price * (1 - 0.15);
//}
//else
//{
//	summa = summa + nap_kol * nap_price;
//}
//if (summa > 50)
//{
//	cout << "Применена скидка 20% на весь заказ!\n";
//	summa = summa * (1 - 0.2);
//}
//cout << "Ваш заказ:\n";
//cout << "Пицца: " << pizza_id << " - " << temp << "штук " << "по " << pizza_price << "$" << "\n";
//cout << "Напиток: " << nap_id << " - " << nap_kol << "штук " << "по " << nap_price << "$" << "\n";
//cout << "Итого: " << summa << "$" << "\n";

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int man1, man2, man3, best_man;
//float zp1, zp2, zp3;
//cout << "Укажите уровень продаж первого менеджера: ";
//cin >> man1;
//cout << "Укажите уровень продаж второго менеджера: ";
//cin >> man2;
//cout << "Укажите уровень продаж третьего менеджера: ";
//cin >> man3;
//if (man1 < 500)
//{
//	zp1 = 200 + man1 * 0.003;
//}
//else if ((man1 >= 500) && (man1 < 1000))
//{
//	zp1 = 200 + man1 * 0.005;
//}
//else
//{
//	zp1 = 200 + man1 * 0.008;
//}
//if (man2 < 500)
//{
//	zp2 = 200 + man2 * 0.003;
//}
//else if ((man1 >= 500) && (man2 < 1000))
//{
//	zp2 = 200 + man2 * 0.005;
//}
//else
//{
//	zp2 = 200 + man2 * 0.008;
//}
//if (man3 < 500)
//{
//	zp3 = 200 + man3 * 0.003;
//}
//else if ((man1 >= 500) && (man3 < 1000))
//{
//	zp3 = 200 + man3 * 0.005;
//}
//else
//{
//	zp3 = 200 + man3 * 0.008;
//}
//if (man1 > man2)
//{
//	best_man = 1;
//}
//else
//{
//	best_man = 2;
//}
//if (man3 > best_man)
//{
//	best_man = 3;
//}
//switch (best_man) {
//case 1:
//	zp1 = zp1 + 200;
//	break;
//case 2:
//	zp2 = zp2 + 200;
//	break;
//case 3:
//	zp3 = zp3 + 200;
//	break;
//}
//cout << "Лучший менеджер - " << best_man << ". Ему начислено 200$ к зарплате. \n";
//cout << "Зарплата первого менеджера: " << zp1 << "\n";
//cout << "Зарплата второго менеджера: " << zp2 << "\n";
//cout << "Зарплата третьего менеджера:" << zp3 << "\n";

//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int sim_cod;
//char sim;
//cout << "Введите символ: ";
//cin >> sim;
//sim_cod = (int)sim;
//if (((sim_cod >= 65) && (sim_cod <= 90)) || ((sim_cod >= 97) && (sim_cod <= 122)) || ((sim_cod >= 'А') && (sim_cod <= 'я')) || ((sim_cod >= 'Ё') && (sim_cod <= 'ё')))
//{
//	cout << "Введена буква: " <<sim;
//}
//else if ((sim_cod >= 48) && (sim_cod <= 57))
//{
//	cout << "Введена цифра: " << sim;
//}
//else if ((sim_cod == '!') || (sim_cod == '?') || (sim_cod == '.') || (sim_cod == ',') || (sim_cod == ';') || 
//	     (sim_cod == ':') || (sim_cod == ')') || (sim_cod == '(') || (sim_cod == '"') || (sim_cod == '-'))
//{
//	cout << "Введен знак препинания: " << sim;
//}
//else
//{
//	cout << "Введен другой символ: " << sim;
//}

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int min, op_m, op_s;
//cout << "Укажите количество минур разговора: ";
//cin >> min;
//cout << "Укажите с какого оператора звоним (1 - МТС, 2 - Билайн, 3 - Теле2): ";
//cin >> op_m;
//cout << "Укажите на какой оператор звоним (1 - МТС, 2 - Билайн, 3 - Теле2): ";
//cin >> op_s;
//double summ_min;
//switch (op_m) {
//case 1: // МТС 
//	switch (op_s) {
//	case 1: summ_min = 1.0; break;  // с МТС на МТС
//	case 2: summ_min = 1.5; break;  // с МТС на Билайн 
//	case 3: summ_min = 2.0; break;  // с МТС на Теле2 
//	default: summ_min = 0.0; break;
//	}
//	break;
//case 2: // Билайн 
//	switch (op_s) {
//	case 1: summ_min = 1.5; break;  // с Билайн на МТС 
//	case 2: summ_min = 1.0; break;  // с Билайн на Билайн 
//	case 3: summ_min = 2.5; break;  // с Билайн на Теле2 
//	default: summ_min = 0.0; break;
//	}
//	break;
//case 3: // Теле2 
//	switch (op_s) {
//	case 1: summ_min = 2.0; break;  // с Теле2 на МТС 
//	case 2: summ_min = 2.5; break;  // с Теле2 на Билайн 
//	case 3: summ_min = 1.0; break;  // с Теле2 на Теле2 
//	default: summ_min = 0.0; break;
//	}
//	break;
//default:
//	summ_min = 0.0;
//	break;
//}
//double result = min * summ_min;
//cout << "Стоимость разговора: " << result << " руб.";


//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int доход, опоздания, строки, штраф, выбор;
//float ставка, заработок;
//штраф = 0;
//ставка = 0.5;
//cout << "1- Указываем желаемый доход и количество опозданий, считаем сколько строк кода необходимо написать.\n";
//cout << "2- Указываем написанное количество строк кода и желаемый доход, считаем сколько раз можно опоздать. \n";
//cout << "3- Указываем написанное количество строк кода и количество опозданий, считаем сколько заплатят. \n";
//cout << "Выберите пункт расчета: ";
//cin >> выбор;
//switch (выбор)
//{
//case 1:
//{
//	cout << "Желаемый доход: ";
//	cin >> доход;
//	cout << "Количество опозданий: ";
//	cin >> опоздания;
//	строки = доход / ставка;
//	if (опоздания >= 3)
//	{
//		штраф = опоздания / 3 * 20;
//		строки = строки + штраф / ставка;
//	}
//	cout << "Количество строк кода: " << строки;
//	
//	break;
//}
//case 2:
//{
//	cout << "Желаемый доход: ";
//	cin >> доход;
//	cout << "Количество строк кода: ";
//	cin >> строки;
//	заработок = строки * ставка;
//	if (доход >= заработок)
//	{
//		cout << "Опаздывать нельзя!";
//	}
//	else 
//	{
//		опоздания = (заработок - доход) / 20 * 3;
//		cout << "Можно опоздать не более: " <<  опоздания + 2 << " раз";
//	}
//	break;
//}
//case 3:
//{
//	cout << "Количество строк кода: ";
//	cin >> строки;
//	cout << "Количество опозданий: ";
//	cin >> опоздания;
//	заработок = строки * ставка;
//	if (опоздания >= 3)
//	{
//		штраф = опоздания / 3 * 20;
//		if (штраф >= заработок)
//		{
//			cout << "Работаем за спасибо!";
//		}
//		else
//		{
//			доход = заработок - штраф;
//			cout << "Заработаем: " << доход << " $";
//		}
//	}
//	else
//	{
//		доход = заработок;
//		cout << "Заработаем: " << доход << " $";
//	}
//	break;
//}
//default:
//	cout << "Ошибка. Пункт не найден.";
//}

//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int a, sum;
//sum = 0;
//cout << "Введите число: ";
//cin >> a;
//while (a <= 500)
//{
//	sum = sum + a;
//	a = a + 1;
//}
//cout << "Сумма = " << sum;

//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int x, y, i;
	//float power;
	//power = 1;
	//cout << "Введите число X: ";
	//cin >> x;
	//cout << "Введите число Y: ";
	//cin >> y;
	//if (y == 0)
	//{
	//	power = 1;
	//}
	//else
	//{
	//	i = 1;
	//}
	//while (i <= abs(y))
	//{
	//	power = power * x;
	//	i = i + 1;
	//}
	//if (y < 0)
	//{
	//	power = 1 / power;
	//}
	//cout << "Результат = " << power;

//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//float result;
	//result = 0;
	//for (int i = 1; i <= 1000; i++)
	//{
	//	result = result + i;
	//}
	//result = result / 1000;
	//cout << "Среднее арифметическое от 1 до 1000: " << result;

//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int a, proiz, i;
	//proiz = 1;
	//cout << "Введите число от 1 до 20: ";
	//cin >> a;
	//for (i = a;i <= 20;i++)
	//{
	//	proiz = proiz * i;
	//}
	//cout << "Произведение = " << proiz;

//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//cout << "Введите число: ";
	//int nomber;
	//cin >> nomber;
	//for (int i = 1; i != 10; ++i) 
	//	cout << nomber << " x " << i << " = " << nomber * i << '\n';
	//cout << endl;
	
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//int num1, num2, num3, same, resN, temp;
	//resN = 0;
	//for (int i = 100; i <= 999; i++)
	//{
	//	same = 0;
	//	num3 = i % 10;
	//	temp = i / 10;
	//	num2 = temp % 10;
	//	num1 = temp / 10;
	//	if ((num1 == num2) && (num1 != num3) && (num2 != num3))
	//	{
	//		same++;
	//	}
	//	if ((num1 != num2) && (num1 == num3) && (num2 != num3))
	//	{
	//		same++;
	//	}
	//	if ((num1 != num2) && (num1 != num3) && (num2 == num3))
	//	{
	//		same++;
	//	}
	//	if (same == 1)
	//	{
	//		cout << i << "\n";
	//		resN++;
	//	}
	//}
	//cout << "Количество чисел с двумя одинаковыми цифрами:" << resN;

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int num1, num2, num3, same, resN, temp;
//resN = 0;
//for (int i = 100; i <= 999; i++)
//{
//	same = 0;
//	num3 = i % 10;
//	temp = i / 10;
//	num2 = temp % 10;
//	num1 = temp / 10;
//	if ((num1 != num2) && (num1 != num3) && (num2 != num3))
//	{
//		cout << i << "\n";
//		resN++;
//	}
//}
//cout << "Количество чисел с разными числами: " << resN;

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int num, iskl, i, result;
//cout << "Введите число: ";
//cin >> num;
//i = 0;
//result = 0;
//while (num > 0)
//{
//	iskl = num % 10;
//	if ((iskl != 3) && (iskl != 6))
//	{
//		result = result + iskl * pow(10, i);
//		i++;
//	}
//	num = num / 10;
//}
//cout << "Ваше число без 3 и 6: " << result;

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int A, B;
//cout << "Введите число: ";
//cin >> A;
//for (int i = A - 1; i > 1; i--)
//{
//	B = i;
//	if ((A % (B * B) == 0) && (A % (B * B * B) != 0))
//	{
//		cout << B << "\n";
//	}
//}

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int a, sum = 0;
//cout << "Введите целое число: ";
//cin >> a;
//int double_a = a;
//for (; double_a != 0; double_a /= 10)
//{
//    sum += double_a % 10;
//}
//if (pow(sum, 3) == pow(a,2))
//{
//    cout << "Куб суммы цифр " << sum << " равен квадрату числа " << a << endl;
//}
//else 
//{
//    cout << "Куб суммы цифр " << sum << " не равен квадрату числа " << a << endl;
//}

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//int num;
//   cout << "Введите целое число: ";
//   cin >> num;
//   for (int i = 1; i <= num; ++i) 
//   {
//       if (num % i == 0) {          
//           cout << i << endl;        
//       }
//   }

//------------------------------------------------------------------------------------------------------------------------------------------//

//std::system("chcp 1251");
//  int num1, num2;
//   cout << "Укажите первое целое число: ";
//   cin >> num1;
//   cout << "Укажите второе целое число: ";
//   cin >> num2;
//   if (num1 >= num2) 
//   {
//       for (int i = 1; i <= num1; ++i)
//       {
//           if (num1 % i == 0 && num2 % i == 0)
//           {
//               cout << i << endl;
//           }
//       }
//   }
//   else if (num1 < num2) 
//   {
//       for (int i = 1; i <= num2; ++i)
//       {
//           if (num1 % i == 0 && num2 % i == 0)
//           {
//               cout << i << endl;
//           }
//       }
//   }
//   else
//   {
//       cout << "Ошибка." << endl;
//}

//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//


//std::system("chcp 1251");
//
//	int num, digit, vibor, kol, null;
//	float sum, sred;
//	sum = 0;
//	kol = 0;
//	null = 0;
//	cout << "Введите число: ";
//	cin >> num;
//	do {
//		cout << "Меню: \n" 
//			<< "1 - Количество цифр\n" 
//			<< "2 - Сумма цифр\n" 
//			<< "3 - Среднее арифметическое значение\n" 
//			<< "4 - Количество нулей\n" 
//			<< "5 - Выход\n";
//		cin >> vibor;
//		while (num > 0)
//		{
//			digit = num % 10;
//			sum += digit;
//			kol++;
//			if (digit == 0)
//			{
//				null++;
//			}
//			num = num / 10;
//		}
//		sred = sum / kol;
//		switch (vibor) {
//		case 1:
//		{
//			cout << "Количество цифр: " << kol << "\n";
//			break;
//		}
//		case 2:
//		{
//			cout << "Сумма цифр: " << sum << "\n";
//			break;
//		}
//		case 3:
//		{
//			cout << "Среднее арифметическое: " << sred << "\n";
//			break;
//		}
//		case 4:
//		{
//			cout << "Количество нулей: " << null << "\n";
//			break;
//		}
//		case 5:
//		{
//			cout << "Завершение работы!";
//			break;
//		}
//		default:
//			cout << "Ошибка. Неверно выбран пункт.";
//		}
//	} while (vibor != 5);


//------------------------------------------------------------------------------------------------------------------------------------------//

	/*std::system("chcp 1251");
	int size;
	cout << "Укажите размер клетки: ";
	cin >> size;
	for (int i = 0; i < 8; i++)
	{
		if (i % 2 == 0)
		{
			for (int m = 0; m < size; m++)
			{
				for (int j = 0; j < 8; j++)
				{
					if (j % 2 == 0)
					{
						for (int k = 0; k < size; k++)
						{
							cout << "*";
						}
					}
					else
					{
						for (int k = 0; k < size; k++)
						{
							cout << "-";
						}
					}
				}
				cout << "\n";
			}
		}
		else {
			for (int m = 0; m < size; m++)
			{
				for (int j = 0; j < 8; j++)
				{
					if (j % 2 == 0)
					{
						for (int k = 0; k < size; k++)
						{
							cout << "-";
						}
					}
					else
					{
						for (int k = 0; k < size; k++)
						{
							cout << "*";
						}
					}
				}
				cout << "\n";
			}
		}
	}*/


//------------------------------------------------------------------------------------------------------------------------------------------//

   //std::system("chcp 1251");
   //int guests;
   //cout << "Укажите количество гостей: ";
   //cin >> guests;
   //const int COFFEE = 120;
   //const int TEA = 80;
   //const int CAKE = 200;
   //const int PASTRY = 150;
   //int total = 0;
   //for (int i = 1; i <= guests; ++i)
   //{
	  // cout << "Формирование заказа для гостя №" << i << ":\n";
	  // int choice;
	  // do {
		 //  cout << "Меню:\n"
			//   << "1. Кофе - " << COFFEE << " руб\n"
			//   << "2. Чай - " << TEA << " руб\n"
			//   << "3. Торт - " << CAKE << " руб\n"
			//   << "4. Пирожное - " << PASTRY << " руб\n"
			//   << "0. Завершить заказ\n\n"
			//   << "Выберите пункт: ";
		 //  cin >> choice;
		 //  switch (choice)
		 //  {
		 //  case 1:
			//   total += COFFEE;
			//   break;
		 //  case 2:
			//   total += TEA;
			//   break;
		 //  case 3:
			//   total += CAKE;
			//   break;
		 //  case 4:
			//   total += PASTRY;
			//   break;
		 //  case 0:
			//   cout << "Заказ гостя № " << i << " закончен.\n";
			//   break;
		 //  default:
			//   cout << "Ошибка: выберите пункт из меню!\n";
		 //  }
	  // } while (choice != 0);
   //}
   //cout << "Итоговая сумма заказа: " << total << " руб\n";

//------------------------------------------------------------------------------------------------------------------------------------------//

	//std::system("chcp 1251");
	//for (int i = 0; i < 10; i++) {
	//   for (char j = 'A'; j <= 'J'; j++)
	//   {
	//	   cout << j << i << " ";
	//   }
	//   cout << endl;
	//}

//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//
//------------------------------------------------------------------------------------------------------------------------------------------//




}

